[
    {
        "title": "Project 5",
        "description": "Reporting tool using data from various sources for tracking performance and actions for existing deals. Helps identify parts that we can include in a future deal along with evaluating how we might change Pricing business logic as the business evolves.",
        "tech" : "Standalone application built on top of Java & Spring Boot using Angular 9 as Front-end. Deployed in Tanzu Application Services (TAS). Uses SQL Server as DB and also interacts with Teradata & Oracle DB."
    },
    {
        "title": "Project 4",
        "description": "Web-based, customer-specific pricing tool used to price customer requested part and consumption lists. Identifies additional discount that could be offered for different customer tiers and level of commitment. Connected to another tool and is the starting point for all Tailored Offerings. A complex pricing strategy is involved which considers a lot of factors and prices the parts accordingly.",
        "tech": "Follows micro service architecture with multiple services running on Java Spring Boot hosted in Tanzu Application Services (TAS). Uses services provided by Cloud Foundry for Service Registry, Discovery and config server. Web Application interacts with all these microservices which is built using Spring Boot and Angular 8."
    },
    {
        "title": "Project 3",
        "description": "The application provides all the information and analytical insights of the Time Inc brands and offers self-service interactive reports to sales users. Application mainly aims at providing various kinds of reports in graphical representation or with export functionality in the form of Excel and PDF.",
        "tech": "Standalone application using Spring MVC built using legacy way of JSP, JavaScript, JQuery etc. Hosted on AWS."
    },
    {
        "title": "Project 2",
        "description": "Portal provides a set of APIs to MVNOs allowing them access to provision and provide customer care to their customers. In addition it also provides administrative interface for MVNO User Access Controls.",
        "tech": "Angular JS application with Java backend hosted on VM."
    },
    {
        "title": "Project 1",
        "description": "Project aimed to develop a Business to Business Portal to a world leader in Telecommunications which eases the interaction with the Business partners and to provide easy access to the Partners. This project was considered one of the most critical projects for the clients as they rely on this portal to manage the Business to Business Communications and transactions.",
        "tech": "Content Management System (CMS) using Oracle Webcenter sites. This tool had it's own syntax driven by JSP."
    }
]